INSERT INTO Accounting.Departments (Name)
VALUES
    (N'Фінансовий відділ'),
    (N'Відділ кадрів'),
    (N'Відділ маркетингу');

INSERT INTO Accounting.Positions (Title)
VALUES
    (N'Менеджер'),
    (N'Аналітик'),
    (N'Керівник'),
    (N'Бухгалтер'),
    (N'Рекрутер');

INSERT INTO Accounting.Employees (FirstName, LastName, Patronymic, Address, DateOfBirth, DateOfEmployment, PhoneNumber, Salary, DepartmentIdentifier, PositionIdentifier)
VALUES
    (N'Олександр', N'Іванов', N'Іванович', N'Київ, вул. Шевченка, 1', '1985-05-10', '2010-02-01', N'+380501234567', 15000.00, 1, 1),
    (N'Марія', N'Петренко', N'Сергіївна', N'Львів, пр. Свободи, 2', '1990-08-20', '2015-03-15', N'+380505678912', 12000.00, 2, 2),
    (N'Ігор', N'Сидоров', N'Петрович', N'Одеса, вул. Дерибасівська, 3', '1987-03-25', '2012-06-10', N'+380501234890', 14000.00, 1, 3),
    (N'Наталія', N'Коваль', N'Олексіївна', N'Харків, вул. Пушкіна, 4', '1982-12-30', '2008-11-20', N'+380507654321', 16000.00, 3, 4),
    (N'Олег', N'Семенко', N'Володимирович', N'Дніпро, вул. Грушевського, 5', '1995-07-05', '2020-01-01', N'+380509876543', 11000.00, 2, 1),
    (N'Анна', N'Мельник', N'Ігорівна', N'Запоріжжя, вул. Незалежності, 6', '1992-02-14', '2019-05-01', N'+380504321678', 13000.00, 1, 2),
    (N'Сергій', N'Дзюба', N'Степанович', N'Полтава, вул. Леніна, 7', '1989-10-15', '2016-04-05', N'+380509876543', 17000.00, 3, 3),
    (N'Тетяна', N'Громова', N'Анатоліївна', N'Суми, вул. Котляревського, 8', '1991-09-18', '2018-07-07', N'+380503456789', 12500.00, 2, 4),
    (N'Владислав', N'Борисенко', N'Олександрович', N'Черкаси, вул. Шевченка, 9', '1984-11-21', '2013-10-10', N'+380501234567', 14500.00, 1, 5),
    (N'Юлія', N'Савченко', N'Ігорівна', N'Чернівці, вул. Федьковича, 10', '1986-04-28', '2011-08-16', N'+380507654321', 15500.00, 3, 1),
    (N'Євген', N'Гончаренко', N'Вікторович', N'Київ, вул. Гончара, 11', '1993-01-22', '2021-06-15', N'+380501111111', 13500.00, 1, 3),
    (N'Людмила', N'Олійник', N'Михайлівна', N'Львів, вул. Личаківська, 12', '1985-07-07', '2009-09-01', N'+380505555555', 12500.00, 2, 4),
    (N'Павло', N'Захарченко', N'Сергійович', N'Харків, вул. Сумська, 13', '1990-03-12', '2014-03-10', N'+380507777777', 14500.00, 3, 5),
    (N'Ірина', N'Кравченко', N'Олександрівна', N'Одеса, вул. Рішельєвська, 14', '1992-11-30', '2017-11-01', N'+380509999999', 15500.00, 1, 1),
    (N'Дмитро', N'Бондар', N'Юрійович', N'Дніпро, вул. Гагаріна, 15', '1995-05-18', '2020-05-20', N'+380503333333', 16500.00, 2, 2);

